Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/N09.tmx
Source language: en_us
Languages: zh_cn

source: Desert Breakdown, 1968
zh_cn: 沙漠抛锚，1968

source: Krystal was asleep when they crossed the Colorado.
zh_cn: 在他们穿过科罗拉多河时，克莉斯托睡着了。

source: Mark had promised to stop for some pictures, but when the moment came he looked over at her and drove on.
zh_cn: 马克之前答应过她，说要停下来拍照，但在可以拍照时，他却只是看了看她，然后开车继续前进。

source: Krystal's face was puffy from the heat blowing into the car.
zh_cn: 车外吹进来的热风把克里斯托的脸吹得肿胀。

source: Her hair, cut short for summer, hung damp against her forehead. Only a few strands lifted in the breeze.
zh_cn: 她那为夏天而剪短的头发，湿润地垂在前额上，只有几缕被微风吹了起来。

source: She had her hands folded over her belly and that made her look even more pregnant than she was.
zh_cn: 她双手重叠捂着小肚子，更显孕态。

source: The tires sang on the metal grillwork of the bridge.
zh_cn: 车轮在桥梁的金属桥面上发出轻快的声音。

source: The river stretched away on both sides, blue as the empty sky.
zh_cn: 河流在两边延伸开去，蓝得就像空旷的天空。

source: Mark saw the shadow of the bridge on the water with the car running through the girders, and the glint of water under the grillwork.
zh_cn: 马克看到了水面上桥的影子，轿车的影子在上面穿行，还看到格子状栏杆下面闪耀的河水。

source: Then the tires went silent.
zh_cn: 然后，轮胎下的声音消失了。

source: California, Mark thought, and for a time he felt almost as good as he had expected to feel.
zh_cn: 加利福尼亚，马克心想。有那么一会儿，他的感觉几乎就像原本预料的那般好。

source: But it soon passed.
zh_cn: 但这种感觉很快就过去了。

source: He had broken his word, and he was going to hear about it when Krystal woke up.
zh_cn: 他食言了，要在克莉斯托醒来后听她抱怨。

source: He almost turned the car around. But he didn't want to have to stop, and hoist Hans up on his shoulders, and watch Krystal point that camera at him again.
zh_cn: 他差点就调了头，但他不想把车停下来，把汉斯举到肩膀上，然后又看着克莉斯托拿那个相机对着他。

source: By now Krystal had hundreds of pictures of Mark, Mark with Hans on his shoulders standing in front of canyons and waterfalls and monumental trees and the three automobiles they'd owned since coming Stateside.
zh_cn: 克莉斯托现在已经拍了几百张马克的相片，都是马克把汉斯举在肩膀上，站在各个峡谷、瀑布、巨大树木，以及他们开始穿越各州以来拥有的那三辆汽车面前。

source: Mark did not photograph well.
zh_cn: 马克不上镜。

source: For some reason he always looked discouraged. But those pictures gave the wrong idea.
zh_cn: 因为某些原因，他在相片上总是不自信，但是这些相片给人的印象不对。

source: An old platoon sergeant of Mark's had an expression he liked to use- "free, white, and twenty-one."
zh_cn: 马克以前的一位副排长喜欢用这种说法——“不羁、白人、二十一岁”。

source: Well, that was an exact description of Mark.
zh_cn: 嗯，这才是对马克的确切描述。

source: Everything was in front of him. All he needed was an opening.
zh_cn: 一切都在他前方，而他需要的只是个良机。

source: Two hawks wheeled overhead, their shadows immense on the baking grey sand.
zh_cn: 两只鹰在头顶上盘旋，影子在炙热的灰色沙地上显得巨大。

source: A spinning funnel of dust moved across the road and disappeared behind a billboard.
zh_cn: 一团旋转着的漏斗形灰尘穿过公路，消失在一块广告牌后面。

source: The billboard had a picture of Eugene McCarthy on it.
zh_cn: 那块广告牌上有张尤金·麦卡锡的照片。

source: McCarthy's hair was blowing around his head. He was grinning.
zh_cn: 麦卡锡咧嘴微笑着，头发被风吹散在脑袋四周。

source: The caption below said, "A Breath of Fresh Air."
zh_cn: 照片下面配有文字：“透透气。”

source: You could tell this was California because in Arizona a McCarthy billboard would last about five minutes.
zh_cn: 你能够辨别出来这里是加利福尼亚州，因为要是在亚利桑那州，麦卡锡的广告牌活不过五分钟。

source: This one had bullet holes in it, but in Arizona someone would have burned it down or blown it up.
zh_cn: 这块广告牌上有个子弹洞，但是要是在亚利桑那州，有人会把它烧掉或者炸飞。

source: The people there were just incredibly backward.
zh_cn: 那里的人真是落后得难以置信。

source: In the distance the mountains were bare and blue.
zh_cn: 远处的群山荒芜、沉闷。

source: Mark passed exit signs for a town called Blythe.
zh_cn: 马克路过几个通向布莱兹镇的出口标志。

source: He considered stopping for some gas, but there was still half a tank and he did not want to risk waking Krystal or Hans.
zh_cn: 他考虑过停下来加油，但是油还有半箱，而且他也不想冒险吵醒克莉斯托或汉斯。

source: He drove on into the desert.
zh_cn: 他继续开车走进了沙漠。

source: They would make Los Angeles by dinnertime.
zh_cn: 他们将在吃晚饭时到达洛杉矶。

source: Mark had an army buddy there who'd offered to put them up for as long as they wanted to stay.
zh_cn: 马克在洛杉矶有位战友，说只要他们愿意，就可以住在他家。

source: He was house-sitting for his parents while they made up their minds whether to get divorced or not.
zh_cn: 他父母正在决定要不要离婚，所以他就替他们看管房子。

source: Mark was sure he'd find something interesting in Los Angeles. Something in the entertainment field.
zh_cn: 马克确信自己能在洛杉矶发现些有趣的东西，娱乐圈的东西。

source: He had been in plays all through high school and could sing pretty well. But his big talent was impersonation.
zh_cn: 高中时他就一直在参演戏剧，而且歌唱得也很不错，但演技才是他的重要天赋。

source: He could mimic anybody.
zh_cn: 他能够模仿任何人。

source: In Germany he had mimicked a Southern fellow in his company so accurately that after a couple of weeks of it the boy asked to be transferred to another unit.
zh_cn: 在德国时，他在连队里滑稽地模仿过一个南方男孩，他模仿得特别准确，所以在几个周后，那个男孩要求调到其它连队。

source: Mark knew he'd gone overboard. He laid off and in the end the boy withdrew his request for transfer.
zh_cn: 马克知道自己玩过分了，所以不再模仿，最终那个男孩收回了调动申请。

source: His best impersonation was his father, Dutch.
zh_cn: 马克模仿得最像的人是他父亲达奇。

source: Sometimes, just for fun, Mark called his mother and talked to her in Dutch's slow, heavy voice, rolling every word along on treads, like a tank.
zh_cn: 有时候只是因为好玩，马克会打电话给母亲，用他父亲那种缓慢、沉重的嗓音与母亲说话，像坦克那样把每个字压得扁平。

source: She always fell for it.
zh_cn: 她母亲总是信以为真。

source: Mark would go on until he got bored, then say something like, "By the way, Dottie, we're bankrupt."
zh_cn: 马克会一直模仿，直到厌倦，然后说两句类似这样的话：“对了，朵蒂，我们破产了。”

source: Then she would catch on and laugh.
zh_cn: 然后她就会知道是马克在模仿，接着大笑起来。

source: Unlike Dutch, she had a sense of humor.
zh_cn: 与达奇不同，她有幽默感。

source: A truck hurtled past.
zh_cn: 一辆卡车从边上飞驰而过。

source: The sound of the engine woke Hans, but Mark reached into the back and rubbed the satin edge of the baby blanket against Hans's cheek.
zh_cn: 引擎的声音吵醒了汉斯，但马克把手伸到后面，用毯子的绸缎边沿擦了擦汉斯的脸颊。

source: Hans put his thumb in his mouth. Then he stuck his rear end in the air and went back to sleep.
zh_cn: 汉斯把拇指含到了嘴里，然后撅起屁股，又继续睡了。

source: The road shimmered. It seemed to float above the desert floor.
zh_cn: 公路闪着微光，看上去像是漂浮在沙漠上空。

source: Mark sang along with the radio, which he had been turning up as the signal grew weaker.
zh_cn: 马克跟着收音机唱起来。信号逐渐变弱，他就一直往上调音量。

source: Suddenly it blared.
zh_cn: 突然，收音机发出刺耳的噪音。

source: He turned it down, but he was too late.
zh_cn: 他把音量调低，但是已经来不及了。

source: Hans woke up again and started fussing.
zh_cn: 汉斯又醒了，而且开始吵闹起来。

source: Mark rubbed his cheek with the blanket.
zh_cn: 马克用毯子擦拭他的脸颊。

source: Hans pushed Mark's arm away and said, "No!"
zh_cn: 汉斯把马克的胳膊推开，然后说：“不要！”

source: It was the only word he knew.
zh_cn: 他只知道这个词。

source: Mark glanced back at him.
zh_cn: 马克向后瞥了他一眼。

source: He'd been sleeping on a toy car and the wheels had left four red dents on the side of his face.
zh_cn: 他一直睡在一辆玩具车上，玩具车的车轮在他脸蛋上留下四个红色的凹痕。

source: Mark stroked his cheek.
zh_cn: 马轻轻克抚摸他的脸颊。

source: "Pretty soon," he said, "pretty soon, Hansy," not meaning anything in particular but wanting to sound upbeat.
zh_cn: “快到了，”他说，“快到了，小汉斯。”他这么说并没有特别指代什么，只是想听起来乐观而已。

source: Krystal was awake now too.
zh_cn: 克莉斯托现在也醒了。

source: For a moment she didn't move or say anything. Then she shook her head rapidly from side to side.
zh_cn: 她呆坐、沉默了片刻，然后迅速地来回摇头。

source: "So hot," she said.
zh_cn: “太热了，”她说道。

source: She held up the locket-watch around her neck and looked at Mark.
zh_cn: 她拿起挂在脖子上的盒式怀表，然后看着马克。

source: He kept his eyes on the road.
zh_cn: 马克始终盯着公路。

source: "Back from the dead," he said. "Boy, you were really out."
zh_cn: “活过来了，”他说，“嗬，你睡得真死。”

source: "The pictures," she said. "Mark, the pictures."
zh_cn: “照相，”她说，“马克，照相啊。”

source: "There wasn't any place to stop," he said.
zh_cn: “刚才没有地方停车，”他说。

source: "But you promised."
zh_cn: “可是你答应过我的。”

source: Mark looked at her, then back at the road.
zh_cn: 马克看了看她，然后又看着公路。

source: "I'm sorry," he said. "There'll be other rivers."
zh_cn: “对不起，”他说，“还会有其它河流的。”

source: "I wanted that one," Krystal said, and turned away.
zh_cn: “我就想要那条，”克莉斯托说道，然后把头转了过去。

source: Mark could tell that she was close to tears.
zh_cn: 马克知道她快要哭了。

source: It made him feel tired.
zh_cn: 这让他觉得疲惫。

source: "All right," he said. "Do you want me to go back?"
zh_cn: “好了，”他说，“你想我开回去吗？”

source: He slowed the car to prove he meant it.
zh_cn: 他放慢车速，证明自己是认真的。

source: "If that's what you want just say the word."
zh_cn: “如果你想我开回去，那就说。”

source: She shook her head.
zh_cn: 她摇了摇头。

source: Mark sped up.
zh_cn: 马克加快了车速。

source: Hans began to kick the back of the seat.
zh_cn: 汉斯开始踢座椅后面。

source: Mark didn't say anything.
zh_cn: 马克没有说话。

source: At least it was keeping Hans busy and quiet.
zh_cn: 至少这能让汉斯忙碌和安静下来。

source: "Hey, gang," Mark said. "Listen up. I've got ten big ones that say we'll be diving into Rick's pool by six o'clock."
zh_cn: “嗨，小家伙，”，马克说，“听着，我出十块钱，打赌我们六点时就可以跳进里克的游泳池里。”

source: Hans gave the seat a kick that Mark felt clear through to his ribs.
zh_cn: 汉斯踢了座椅一下，马克清晰地感觉到这一踢传到了肋骨上。

source: "Ten big ones," Mark said. "Any takers?"
zh_cn: “十块钱哟，”马克说，“有人接受吗？”

source: He looked over at Krystal and saw that her lips were trembling.
zh_cn: 他朝克莉斯托看了看，看见她的嘴唇在微微颤动。

source: He patted the seat beside him.
zh_cn: 他拍了拍边上的座位。

source: She hesitated, then slid over and leaned against him, as he knew she would.
zh_cn: 克莉斯托犹豫了，然后滑坐过去，倚靠到他身上。马克就知道她会这样做。

source: Krystal was not one to hold a grudge.
zh_cn: 克莉斯托不是个记仇的人。

source: He put his arm around her shoulder.
zh_cn: 他伸胳膊搂住了她的肩膀。

source: "So much desert," she said.
zh_cn: “这么多沙漠，”她说。

source: "It's something, all right."
zh_cn: “也挺壮观啊。”

source: "No trees," she said. "At home I could never imagine."
zh_cn: “连树都没有，”她说，“在家里我绝对没法设想。”

source: Hans stopped kicking. Then, without warning, he grabbed Mark's ears.
zh_cn: 汉斯停止踢踹，然后毫无预兆地揪住了马克的两只耳朵。

source: Krystal laughed and pulled him over the seat onto her lap.
zh_cn: 克莉斯托大笑起来，然后把汉斯从座位上面抱过来放到自己的大腿上。

source: He immediately arched his back and slid down to the floor, where he began to tug at the gear shift.
zh_cn: 汉斯立马弓起背，滑到地上，然后开始拉拽排档杆。

source: "I have to stop," Krystal said.
zh_cn: “我得停下来，”克莉斯托说。

source: She patted her belly.
zh_cn: 她轻轻拍了拍肚子。

source: "This one likes to sit just so, here, on my bladder."
zh_cn: 这家伙喜欢这样坐，这里，坐在我的膀胱上。”

source: Mark nodded.
zh_cn: 马克点了点头。

source: Krystal knew the English words for what Dottie had always been content to call her plumbing, and when she was pregnant she liked to describe in pretty close detail what went on in there. It made Mark queasy.
zh_cn: 克莉斯托知道朵蒂喜欢用来指代生殖系统的那些英语单词。在她怀孕时，她喜欢特别详细地描述肚子里面的情况，这让马克有些不舒服。

source: "Next chance we get," he said. "We're low anyway."
zh_cn: “等下次机会吧，”他说，“反正油不多了。”

source: Mark turned off at an exit with one sign that said GAS.
zh_cn: 马克在一个写着“加油站”的标牌处拐了弯，变换了道路。

source: There was no mention of a town.
zh_cn: 没有提及市镇的标牌。

source: The road went north over bleached hardpan crazed with fissures.
zh_cn: 那条道路向北延伸，发白的硬质地面上有许多裂缝。

source: It seemed to be leading them toward a solitary mountain far away that looked to Mark like a colossal sinking ship.
zh_cn: 它似乎是通向远处的一座孤山，这座孤山在马克看来就像一艘正在下沉的巨大船只。

source: Phantom water glistened in the desert.
zh_cn: 虚幻的水塘在沙漠里闪闪发光。

source: Rabbits darted back and forth across the road.
zh_cn: 兔子在路上来回穿越。

source: Finally they came to the gas station, an unpainted cement-block building with some pickup trucks parked in front.
zh_cn: 最终，他们抵达加油站，那是栋没有粉刷的水泥砖建筑，前面听着几辆皮卡车。

source: Mark pulled in.
zh_cn: 马克把车开过去停下来。

source: There were four men sitting on a bench in the shade of the building.
zh_cn: 加油站阴影下的长椅上坐着四个男人。

source: They watched the car come toward them.
zh_cn: 他们看着马克的车朝自己驶来。

source: "Cowboys," Krystal said. "Look, Hans, cowboys!"
zh_cn: “牛仔，”克莉斯托说，“快看，汉斯，有牛仔。”

source: Hans stood on Krystal's legs and looked out the window.
zh_cn: 汉斯站在克莉斯托的腿上，朝窗外望去。

source: Krystal still thought that everyone who wore a cowboy hat was a cowboy.
zh_cn: 克莉斯托仍然觉得戴着牛仔帽的人都是牛仔。

source: Mark had tried to explain that it was a style, but she refused to understand.
zh_cn: 马克曾经尝试解释说这是时尚，但她拒绝去理解。

source: He drove up to a pump and turned off the engine.
zh_cn: 他把车开到油泵边上，然后关掉了引擎。

source: The four men stared at them.
zh_cn: 那四个男人盯着他们。

source: Their faces were dark under the wide brims of their hats.
zh_cn: 他们的脸在宽大的帽檐下显得黝黑。

source: They looked as if they had been there forever.
zh_cn: 他们看上去就像永恒地坐在在那里。

source: One of the men got up from the bench and walked over.
zh_cn: 其中有个男人从长凳上站起来，然后走了过来。

source: He was tall and carried a paunch that seemed out of place on his bony frame.
zh_cn: 他长得很高，挺着个与干瘦身形不相称的啤酒肚。

source: He bent down and looked inside the car.
zh_cn: 他弯腰往车里看。

source: He had little black eyes with no eyebrows.
zh_cn: 他有双黑色的小眼睛，没有眉毛。

source: His face was red, as if he were angry about something.
zh_cn: 他的脸颊通红，似乎是在生什么气。

source: "Regular, please," Mark said. "All she'll take."
zh_cn: “常规的油，劳驾，”马克说，“加满。”

source: The man stared openly at Krystal's belly.
zh_cn: 那个男人毫不隐晦地盯着克莉斯托的肚子，然后站直身子走开了。

source: He straightened up and walked away, past the men on the bench, up to the open door of the building. He stuck his head inside and yelled. Then he sat on the bench again.
zh_cn: 他从长凳上那几个男人身边经过，向上走到房子敞开的门口，把头伸进去大喊，然后又坐回到长凳上。

source: The man next to him looked down and mumbled something.
zh_cn: 他旁边的那个男人向下看了看，然后嘟哝了些什么。

source: The others laughed.
zh_cn: 其他几个男人大笑起来。

source: Somebody else in a cowboy hat came out of the building and went around to the back of the car.
zh_cn: 另外有位戴牛仔帽的男人从房子里出来，然后绕到车后面。

source: "Mark," Krystal said.
zh_cn: “马克，”克莉斯托说道。

source: "I know," Mark said. "The bathroom."
zh_cn: “我知道，”马克说，“洗手间。”

source: He got out of the car.
zh_cn: 他从车里出来。

source: The heat took him by surprise; he could feel it coming down like rain.
zh_cn: 外面的炎热让他吃了一惊；他感觉这种炎热像雨一样倾泻下来。

source: The person pumping gas said, "You need oil or anything?" and that was when Mark realized it was a woman.
zh_cn: 加油的那个人说：“你需要润滑油或其它什么吗？”马克这才意识到那是个女人。

source: She was looking down at the nozzle, so he couldn't see her face, only the top of her hat.
zh_cn: 她低头看着管口，所以马克看不见她的脸，只能看到她的帽顶。

source: Her hands were black with grease.
zh_cn: 她的双手沾满了黑色的油脂。

source: "My wife would like to use your bathroom," he said.
zh_cn: “我妻子想借用你家的洗手间，”他说。

source: She nodded.
zh_cn: 她点了点头。

source: When the tank was full she thumped on the roof of the car.
zh_cn: 邮箱装满后，她拍了拍车顶。

source: "Okay," she said, and walked toward the building.
zh_cn: “加好了，”她说道，然后朝房子走去。

source: Krystal opened the door.
zh_cn: 克莉斯托打开车门。

source: She swung her legs out, then rocked forward and pushed herself up into the light.
zh_cn: 她把双腿抬出去，然后缓缓地向前挪动，让自己站起来，站到阳光里面。

source: She stood for a moment, blinking.
zh_cn: 她眨着眼，站了片刻。

source: The four men looked at her.
zh_cn: 那四个男人看着她。

source: So did Mark.
zh_cn: 马克也看着她。

source: He made allowances for the fact that Krystal was pregnant, but she was still too heavy.
zh_cn: 他体谅克莉斯托怀孕这件事，但她仍然太壮实。

source: Her bare arms were flushed from the heat. So was her face.
zh_cn: 她裸露的双臂被热得通红，她的脸颊也是。

source: She looked like one of those stein-slinging waitresses in the Biergarten where she and Mark used to drink.
zh_cn: 她看上去就像她和马克经常去的那家啤酒园酒吧里那些端大啤酒杯的女服务员。

source: He wished that these fellows could have seen the way Krystal looked wearing that black dress of hers, with her hair long, when they'd first started going out together.
zh_cn: 他希望这些家伙能够看到克莉斯托刚开始和他约会时身穿黑色裙子、披着长发的样子。

source: Krystal shaded her eyes with one hand. With the other hand she pulled her blouse away from where it stuck to her skin.
zh_cn: 克莉斯托用一只手遮着眼睛上方，用另外那只手把粘在身上的衬衫拉松。

source: "More desert," she said.
zh_cn: “又是沙漠，”她说。

source: She lifted Hans out of the car and began to carry him toward the building, but he kicked free and ran over to the bench.
zh_cn: 他把汉斯从车里抱出来，然后抱着他开始往房子走去，但是汉斯却蹬腿挣脱，跑到了长凳那边。

source: He stood there in front of the men, naked except for his diaper.
zh_cn: 他站在那几个男人前面，浑身赤裸，只穿着尿布。

source: "Come here," Krystal said.
zh_cn: “到这里来，”克莉斯托说。

source: When he didn't obey she started toward him, then looked at the men and stopped.
zh_cn: 汉斯不听她的话，于是她便迈步朝他那边走去，接着看了看那几个男人，然后又停了下来。

source: Mark went over.
zh_cn: 马克走了过去。

source: "Let's go, Hansy," he said.
zh_cn: “我们走，小汉斯，”他说。

source: He picked Hans up, and felt a sudden tenderness that vanished when Hans began to struggle.
zh_cn: 他抱起汉斯，突然有种慈爱的感觉，但这种感觉在汉斯开始挣扎时消失了。

source: The woman took Krystal and Hans inside the building, then came out and sat on the pile of scrap lumber beside the door.
zh_cn: 那个女人把克莉斯托和汉斯带进屋，然后走出来坐到门边那堆废弃木材上。

source: "Hans," she said. "That's a funny name for a little boy."
zh_cn: “汉斯，”她说，“小男生用这个名字很好笑。”

source: "It was her father's name," Mark said, and so it was.
zh_cn: “那是他外公的名字，”马克实事求是地说。

source: The original Hans had died shortly before the baby was born.
zh_cn: 在他出生前不久，他外公汉斯就去世了。

source: Otherwise Mark never would have agreed.
zh_cn: 否则马克绝对不会同意用这个名字。

source: Even Germans didn't name their kids Hans anymore.
zh_cn: 即使是德国人也不再给孩子取名汉斯了。

source: One of the men flicked a cigarette butt toward Mark's car.
zh_cn: 有个男人把烟头往马克的车边弹去。

source: It fell just short and lay there, smoldering.
zh_cn: 烟头飞得不远，掉在地上冒着烟。

source: Mark took it as a judgment on the car.
zh_cn: 马克觉得那个男人是在评价他的车。

source: It was a good car, a 1958 Bonneville he'd bought two weeks ago when the Ford started to smoke, but a previous owner had put a lot of extra chrome on it and right now it was gleaming every which way.
zh_cn: 那是辆好车，1958年产的博纳维尔，是在两个星期前他那辆福特开始冒烟后买的，不过原来的车主在车上额外镀了许多铬，所以现在不管从哪个角度看，它都闪着微光。

source: It looked foolish next to these dented pickups with their gun racks and dull, blistering paint.
zh_cn: 它在那些外表坑坑洼洼、毫无光泽、漆皮气泡的皮卡车边上显得滑稽。

source: Mark wished he'd tanked up in Blythe.
zh_cn: 马克心想自己应该在布莱兹镇加油的。
